Team-Isaac-Polito/STM32LowLevel/STM32LowLevel/Lib/DynamixelLL/DynamixelLL.h
/**
 * @file DynamixelLL.h
 * @brief Low-level Dynamixel Protocol 2.0 driver for STM32G474 (USART2 LL backend).
 *
 * e-manual for DYNAMIXEL protocol 2.0: https://emanual.robotis.com/docs/en/dxl/protocol2/
 * e-Manual for DYNAMIXEL XL430-W250: https://emanual.robotis.com/docs/en/dxl/x/xl430-w250/
 * e-Manual for DYNAMIXEL XM540-W270: https://emanual.robotis.com/docs/en/dxl/x/xm540-w270/
 *
 * Physical layer:
 *   - DXL Bus: USART2, PA2 TX (half-drain, shared TX/RX in half-duplex),
 *               PA1 DE (direction control for SN74LVC1T45), 2 Mbps
 *
 * The USART is configured in single-wire half-duplex mode (HDSEL=1).
 * The TX pin serves as both transmit and receive.  The DE pin controls
 * the SN74LVC1T45 level shifter direction via sendPacket().
 */

#ifndef DYNAMIXEL_LL_H
#define DYNAMIXEL_LL_H

#include <cstdint>

#include "stm32g4xx_ll_usart.h"
#include "stm32g4xx_ll_crc.h"
#include "stm32g4xx_ll_gpio.h"
#include "stm32g4xx_hal.h" // HAL_GetTick() for timeouts
#include "Debug.h"

// clang-format off
// Instruction codes
#define DXL_INST_PING          0x01u //< Instruction that checks whether the Packet has arrived at a device with the same ID as the specified packet ID
#define DXL_INST_READ          0x02u //< Instruction to read data from the Device
#define DXL_INST_WRITE         0x03u //< Instruction to write data to the Device
#define DXL_INST_FACTORY_RESET 0x06u //< Instruction that resets the Control Table to its initial factory default settings
#define DXL_INST_REBOOT        0x08u //< Instruction to reboot the Device
#define DXL_INST_SYNC_WRITE    0x83u //< Instruction to write data to multiple devices with the same Address with the same length at once
#define DXL_INST_SYNC_READ     0x82u //< Instruction to read data from multiple devices with the same Address with the same length at once
#define DXL_INST_BULK_WRITE    0x93u //< Instruction to write data to multiple devices with different Addresses with different lengths at once
#define DXL_INST_BULK_READ     0x92u //< Instruction to read data from multiple devices with different Addresses with different lengths at once
#define DXL_STATUS_INST        0x55u //< Return packet sent following the execution of an Instruction Packet

#define DXL_BROADCAST_ID     0xFEu  //< Broadcast ID
#define DXL_RX_TIMEOUT_MS    10u    //< Receive timeout in milliseconds
#define DXL_MAX_PACKET_SIZE  128u   //< Maximum receive buffer size (bytes)
// clang-format on

/**
 * @brief Decoded status packet returned by a Dynamixel servo.
 */
struct DxlStatusPacket
{
    bool valid;         //< True if packet is valid and CRC passed
    uint8_t id;         //< Servo ID that sent the response
    uint8_t error;      //< Error byte from status packet
    uint8_t data[8];    //< Parameter bytes (up to 8)
    uint8_t dataLength; //< Number of parameter bytes received
};

/**
 * @brief Velocity profile types.
 */
enum class DxlVelocityProfile : uint8_t
{
    ProfileNotUsed = 0,
    RECTANGULAR = 1,
    TRIANGULAR = 2,
    TRAPEZOIDAL = 3,
};

/**
 * @brief Decoded moving-status register.
 */
struct DxlMovingStatus
{
    uint8_t raw;                    //< Raw register byte (address 123).
    DxlVelocityProfile profileType; //< Active velocity profile type (bits [5:4]).
    bool followingError;            //< True if position following error threshold exceeded (bit 3).
    bool profileOngoing;            //< True if the velocity profile is still being executed (bit 1).
    bool inPosition;                //< True if goal position has been reached (bit 0).
};

/**
 * @brief Low-level Dynamixel Protocol 2.0 driver.
 *
 * One instance per servo.  Multiple servos on the same bus share the same
 * USART peripheral — pass the same `usart` pointer.
 *
 * Sync/bulk operations broadcast across all servos in the sync group.
 *
 * Usage:
 *   // After MX_USART2_UART_Init() and dxlBusInit(USART2):
 *   DynamixelLL motor(USART2, SERVO_TRACTION_R_ID);
 *   motor.setTorqueEnable(true);
 *   motor.setGoalVelocityRpm(10.0f);
 */
class DynamixelLL
{
  public:
    /**
     * @brief Construct a DynamixelLL instance.
     * @param usart   USART peripheral (USART2 for DXL bus).
     * @param servoID Target servo ID (0–253).
     */
    DynamixelLL(USART_TypeDef* usart, uint8_t servoID);
    ~DynamixelLL();

    DynamixelLL(const DynamixelLL&) = delete;
    DynamixelLL& operator=(const DynamixelLL&) = delete;

    /**
     * @brief Enable synchronous (broadcast) mode for a group of servos.
     *
     * After calling this, sync write/read methods broadcast a single packet to
     * all `motorIDs` simultaneously instead of addressing `_servoID` alone.
     *
     * @param motorIDs  Array of servo IDs to include in the sync group.
     * @param numMotors Number of entries in `motorIDs` (must be ≥ 2).
     */
    void enableSync(const uint8_t* motorIDs, uint8_t numMotors);

    /**
     * @brief Disable synchronous mode and release the motor-ID array.
     *
     * After calling this, all methods address `_servoID` directly again.
     */
    void disableSync();

    /**
     * @brief Set the operating mode (control table address 11).
     *
     * @param mode Operating mode: 0=Current, 1=Velocity, 3=Position,
     *             4=ExtendedPosition, 5=CurrentBasedPosition, 16=PWM.
     * @return Error byte from status packet (0 = success).
     */
    uint8_t setOperatingMode(uint8_t mode);

    /**
     * @brief Set the homing offset in raw encoder counts (control table address 20).
     *
     * @param offset Homing offset in raw units (−1,044,479 to 1,044,479).
     * @return Error byte from status packet (0 = success).
     */
    uint8_t setHomingOffset(int32_t offset);

    /**
     * @brief Set the homing offset converted from degrees.
     *
     * Converts `offsetAngle` to raw encoder units using RAD_TO_DXL and sets
     * control table address 20.
     *
     * @param offsetAngle Homing offset angle in degrees.
     * @return Error byte from status packet (0 = success).
     */
    uint8_t setHomingOffsetA(float offsetAngle);

    /**
     * @brief Set goal position in Position Control Mode (control table address 116).
     *
     * @param goalPosition Target position in raw units (0–4095 for one full turn).
     * @return Error byte from status packet (0 = success).
     */
    uint8_t setGoalPositionPcm(uint16_t goalPosition);

    /**
     * @brief Set goal position in degrees for Position Control Mode.
     *
     * Converts `angleDegrees` to raw position units and writes address 116.
     *
     * @param angleDegrees Target angle in degrees (0.0–360.0).
     * @return Error byte from status packet (0 = success).
     */
    uint8_t setGoalPositionAPcm(float angleDegrees);

    /**
     * @brief Set goal position in Extended Position Control Mode (control table address 116).
     *
     * Supports multi-turn positioning beyond one revolution.
     *
     * @param extendedPosition Target position in raw encoder counts.
     * @return Error byte from status packet (0 = success).
     */
    uint8_t setGoalPositionEpcm(int32_t extendedPosition);

    /**
     * @brief Enable or disable motor torque (control table address 64).
     *
     * @param enable True to enable torque output, false to disable.
     * @return Error byte from status packet (0 = success).
     */
    uint8_t setTorqueEnable(bool enable);

    /**
     * @brief Turn the servo status LED on or off (control table address 65).
     *
     * @param enable True to turn the LED on, false to turn it off.
     * @return Error byte from status packet (0 = success).
     */
    uint8_t setLED(bool enable);

    /**
     * @brief Set the status return level (control table address 68).
     *
     * @param level 0 = no response, 1 = respond to READ only, 2 = respond to all.
     * @return Error byte from status packet (0 = success).
     */
    uint8_t setStatusReturnLevel(uint8_t level);

    /**
     * @brief Change the servo ID (control table address 7).
     *
     * @note Torque must be disabled before changing the ID.
     * @param newID New servo ID (0–252; 253–255 are reserved).
     * @return Error byte from status packet (0 = success).
     */
    uint8_t setID(uint8_t newID);

    /**
     * @brief Set the baud rate index (control table address 8).
     *
     * @param baudRate Baud rate index (3 = 1 Mbps, 4 = 2 Mbps, 7 = 4.5 Mbps).
     * @return Error byte from status packet (0 = success).
     */
    uint8_t setBaudRate(uint8_t baudRate);

    /**
     * @brief Set the return delay time (control table address 9).
     *
     * Actual delay in microseconds = `delayTime` × 2.
     *
     * @param delayTime Delay in 2 µs units (0–254).
     * @return Error byte from status packet (0 = success).
     */
    uint8_t setReturnDelayTime(uint8_t delayTime);

    /**
     * @brief Configure drive mode bits (control table address 10).
     *
     * @param torqueOnByGoalUpdate True to auto-enable torque when a goal is updated.
     * @param timeBasedProfile     True to interpret profile values as time (ms) instead of velocity.
     * @param reverseMode          True to reverse the direction of rotation.
     * @return Error byte from status packet (0 = success).
     */
    uint8_t setDriveMode(bool torqueOnByGoalUpdate, bool timeBasedProfile, bool reverseMode);

    /**
     * @brief Set the profile velocity (control table address 112).
     *
     * Each unit corresponds to 0.229 RPM.  Set to 0 for maximum velocity.
     *
     * @param profileVelocity Profile velocity in raw units.
     * @return Error byte from status packet (0 = success).
     */
    uint8_t setProfileVelocity(uint32_t profileVelocity);

    /**
     * @brief Set the profile acceleration (control table address 108).
     *
     * Each unit corresponds to 214.577 Rev/min².  Set to 0 for maximum acceleration.
     *
     * @param profileAcceleration Profile acceleration in raw units.
     * @return Error byte from status packet (0 = success).
     */
    uint8_t setProfileAcceleration(uint32_t profileAcceleration);

    /**
     * @brief Set goal velocity in RPM (Velocity Control Mode, control table address 104).
     *
     * Positive values rotate CCW, negative values rotate CW.
     *
     * @param rpm Target velocity in revolutions per minute.
     * @return Error byte from status packet (0 = success).
     */
    uint8_t setGoalVelocityRpm(float rpm);

    /**
     * @brief Set goal PWM duty cycle (PWM Control Mode, control table address 100).
     *
     * Each unit ≈ 0.113 %.  Valid range: −885 to +885.
     *
     * @param goalPWM PWM value (negative = reverse direction).
     * @return Error byte from status packet (0 = success).
     */
    uint8_t setGoalPWM(int16_t goalPWM);

    /**
     * @brief Read present velocity in RPM (control table address 128).
     *
     * @param[out] rpm Present velocity in revolutions per minute.
     * @return Error byte from status packet (0 = success).
     */
    uint8_t getPresentVelocityRpm(float& rpm);

    /**
     * @brief Read present position in raw encoder counts (control table address 132).
     *
     * @param[out] presentPosition Present position value.
     * @return Error byte from status packet (0 = success).
     */
    uint8_t getPresentPosition(int32_t& presentPosition);

    /**
     * @brief Read present load percentage (control table address 126).
     *
     * Range: −1000 to +1000, where each unit = 0.1 % of stall torque.
     * Positive = CCW direction, negative = CW direction.
     *
     * @param[out] currentLoad Present load value.
     * @return Error byte from status packet (0 = success).
     */
    uint8_t getCurrentLoad(int16_t& currentLoad);

    /**
     * @brief Read the Moving Status register (control table address 123).
     *
     * @param[out] status Decoded moving status (profile type, following error, in-position flag).
     * @return Error byte from status packet (0 = success).
     */
    uint8_t getMovingStatus(DxlMovingStatus& status);

    /**
     * @brief Read the Hardware Error Status register (control table address 70).
     *
     * @param[out] hwErrorStatus Bitmask of active hardware fault flags.
     * @return Error byte from status packet (0 = success).
     */
    uint8_t getHardwareErrorStatus(uint8_t& hwErrorStatus);

    /**
     * @brief Read the present internal temperature in °C (control table address 146).
     *
     * @param[out] temperature Internal temperature in degrees Celsius.
     * @return Error byte from status packet (0 = success).
     */
    uint8_t getPresentTemperature(uint8_t& temperature);

    /**
     * @brief Turn off the servo LED (control table address 65).
     */
    void ledOff();

    /**
     * @brief Print the last raw response bytes via the Debug library (LOG_DEBUG).
     */
    void printResponse();

    /**
     * @brief Ping the servo and retrieve its model number.
     *
     * @param[out] modelNumber 16-bit model number encoded in bits [15:0].
     * @return Error byte from status packet (0 = success).
     */
    uint8_t ping(uint32_t& modelNumber);

    /**
     * @brief Restore factory default settings.
     *
     * @param level Reset scope: 0x01 = all registers,
     *              0x02 = all except ID, 0xFF = all except ID and baud rate.
     * @return Error byte from status packet (0 = success).
     */
    uint8_t factoryReset(uint8_t level);

    /**
     * @brief Reboot the servo (triggers an internal hardware reset).
     *
     * @return Error byte from status packet (0 = success).
     */
    uint8_t reboot();

    /**
     * @brief Read a register from multiple servos simultaneously (SYNC_READ).
     *
     * Broadcasts a SYNC_READ packet to all `ids` and collects one status
     * response per servo, matching each response to the correct index by ID.
     *
     * @tparam T         Result type matching the register width.
     * @param address    Control table register address to read.
     * @param dataLength Register width in bytes (should equal sizeof(T)).
     * @param ids        Array of servo IDs.
     * @param[out] values Array to receive one value per servo.
     * @param count      Number of servos.
     * @return 0 on full success, non-zero error byte if any response had an error.
     */
    template <typename T>
    uint8_t syncRead(uint16_t address, uint8_t dataLength, const uint8_t* ids, T* values, uint8_t count);

    /**
     * @brief Write different values to different registers on multiple servos (BULK_WRITE).
     *
     * @param ids         Array of servo IDs.
     * @param addresses   Array of control table addresses, one per servo.
     * @param dataLengths Array of byte counts to write, one per servo.
     * @param values      Array of values to write, one per servo.
     * @param count       Number of servos.
     * @return True if the packet was sent successfully.
     */
    bool bulkWrite(const uint8_t* ids, uint16_t* addresses, uint8_t* dataLengths, uint32_t* values, uint8_t count);

    /**
     * @brief Read different registers from different servos simultaneously (BULK_READ).
     *
     * @param ids         Array of servo IDs.
     * @param addresses   Array of control table addresses, one per servo.
     * @param dataLengths Array of byte counts to read, one per servo.
     * @param[out] values Array to receive one value per servo.
     * @param count       Number of servos.
     * @return 0 on full success, non-zero error byte if any response had an error.
     */
    uint8_t bulkRead(const uint8_t* ids, uint16_t* addresses, uint8_t* dataLengths, uint32_t* values, uint8_t count);

    /** @brief Set operating mode for each motor in the sync group. */
    template <uint8_t N>
    uint8_t setOperatingMode(const uint8_t (&modes)[N]);

    /** @brief Set homing offset (raw) for each motor in the sync group. */
    template <uint8_t N>
    uint8_t setHomingOffset(const int32_t (&offsets)[N]);

