Team-Isaac-Polito/STM32LowLevel/STM32LowLevel/Lib/DynamixelLL/DynamixelLL.h
    /** @brief Set homing offset (degrees) for each motor in the sync group. */
    template <uint8_t N>
    uint8_t setHomingOffsetA(const float (&offsetAngles)[N]);

    /** @brief Set goal position (PCM, raw) for each motor in the sync group. */
    template <uint8_t N>
    uint8_t setGoalPositionPcm(const uint16_t (&goalPositions)[N]);

    /** @brief Set goal position (degrees, PCM) for each motor in the sync group. */
    template <uint8_t N>
    uint8_t setGoalPositionAPcm(const float (&angleDegrees)[N]);

    /** @brief Set goal position (EPCM, raw) for each motor in the sync group. */
    template <uint8_t N>
    uint8_t setGoalPositionEpcm(const int32_t (&extendedPositions)[N]);

    /** @brief Enable or disable torque for each motor in the sync group. */
    template <uint8_t N>
    uint8_t setTorqueEnable(const bool (&enable)[N]);

    /** @brief Set LED state for each motor in the sync group. */
    template <uint8_t N>
    uint8_t setLED(const bool (&enable)[N]);

    /** @brief Set status return level for each motor in the sync group. */
    template <uint8_t N>
    uint8_t setStatusReturnLevel(const uint8_t (&levels)[N]);

    /** @brief Set servo ID for each motor in the sync group. */
    template <uint8_t N>
    uint8_t setID(const uint8_t (&newIDs)[N]);

    /** @brief Set baud rate index for each motor in the sync group. */
    template <uint8_t N>
    uint8_t setBaudRate(const uint8_t (&baudRates)[N]);

    /** @brief Set return delay time for each motor in the sync group. */
    template <uint8_t N>
    uint8_t setReturnDelayTime(const uint8_t (&delayTimes)[N]);

    /** @brief Configure drive mode for each motor in the sync group. */
    template <uint8_t N>
    uint8_t setDriveMode(const bool (&torqueOnByGoalUpdate)[N],
                         const bool (&timeBasedProfile)[N],
                         const bool (&reverseMode)[N]);

    /** @brief Set profile velocity for each motor in the sync group. */
    template <uint8_t N>
    uint8_t setProfileVelocity(const uint32_t (&profileVelocity)[N]);

    /** @brief Set profile acceleration for each motor in the sync group. */
    template <uint8_t N>
    uint8_t setProfileAcceleration(const uint32_t (&profileAcceleration)[N]);

    /** @brief Set goal velocity (RPM) for each motor in the sync group. */
    template <uint8_t N>
    uint8_t setGoalVelocityRpm(const float (&rpmValues)[N]);

    /** @brief Read present velocity (RPM) from each motor in the sync group. */
    template <uint8_t N>
    uint8_t getPresentVelocityRpm(float (&rpms)[N]);

    /** @brief Read present position from each motor in the sync group. */
    template <uint8_t N>
    uint8_t getPresentPosition(int32_t (&presentPositions)[N]);

    /** @brief Read present load from each motor in the sync group. */
    template <uint8_t N>
    uint8_t getCurrentLoad(int16_t (&currentLoad)[N]);

    /** @brief Read moving status from each motor in the sync group. */
    template <uint8_t N>
    uint8_t getMovingStatus(DxlMovingStatus (&status)[N]);

    /**
     * @brief Register a callback invoked on every DXL TX (after TC) and every
     *        valid RX (after CRC pass).  Pass nullptr to disable.
     *
     * Called from a blocking main-loop context — keep it short (e.g. GPIO toggle).
     */
    static void setActivityCallback(void (*cb)(void))
    {
        activityCb = cb;
    }

  private:
    USART_TypeDef* _usart; //< USART peripheral
    uint8_t _servoID;      //< Target servo ID

    bool _sync = false;           //< Sync-broadcast mode active
    uint8_t _numMotors = 1;       //< Number of motors in sync group
    uint8_t* _motorIDs = nullptr; //< Motor IDs for sync group

    uint8_t _error = 0; //< Last error byte received from a status packet.

    static void (*activityCb)(void); //< Optional TX/RX activity hook (shared across all instances).

    /**
     * @brief Transmit a raw byte packet over the USART (blocking, LL).
     *
     * Waits for the TC (Transmission Complete) flag before returning so that
     * the RS-485 DE line is de-asserted before the servo replies.
     *
     * @param packet Pointer to packet bytes.
     * @param length Number of bytes to transmit.
     * @return True on success, false if the USART is not ready.
     */
    bool sendPacket(const uint8_t* packet, uint16_t length);

    /**
     * @brief Receive a Dynamixel status packet with timeout (blocking, LL).
     *
     * Searches for the 4-byte header (0xFF 0xFF 0xFD 0x00), assembles the
     * full packet, verifies the CRC-16-IBM, and discards echo bytes that
     * appear in half-duplex mode (byte 7 ≠ 0x55 → recurse).
     *
     * @return Decoded DxlStatusPacket; `valid` is false on timeout or CRC error.
     */
    DxlStatusPacket receivePacket();

    /**
     * @brief Compute CRC-16-IBM using the STM32G474 hardware CRC unit.
     *
     * The CRC unit must be initialised for CRC-16-IBM (poly 0x8005, init 0x0000)
     * before this is called — see Core/Src/crc.c generated by CubeMX.
     *
     * @param data   Pointer to byte array.
     * @param length Number of bytes.
     * @return CRC-16-IBM result.
     */
    uint16_t calculateCRC(const uint8_t* data, uint16_t length);

    /**
     * @brief Send a WRITE instruction and wait for the status response.
     *
     * @param address Control table register address.
     * @param value   Value to write (up to 4 bytes, little-endian).
     * @param size    Register width in bytes (1, 2, or 4).
     * @return Error byte from status packet (0 = success).
     */
    uint8_t writeRegister(uint16_t address, uint32_t value, uint8_t size);

    /**
     * @brief Send a READ instruction and parse the typed response.
     *
     * @tparam T      Result type matching the register width.
     * @param address Control table register address.
     * @param[out] value  Receives the register value on success.
     * @param size    Register width in bytes (should equal sizeof(T)).
     * @return Error byte from status packet (0 = success).
     */
    template <typename T>
    uint8_t readRegister(uint16_t address, T& value, uint8_t size);

    /**
     * @brief Send a Sync Write instruction to multiple servos simultaneously.
     *
     * @param address    Control table register address.
     * @param dataLength Register width in bytes.
     * @param ids        Array of servo IDs.
     * @param values     Array of values to write, one per servo.
     * @param count      Number of servos.
     * @return True if the packet was sent successfully.
     */
    bool syncWrite(uint16_t address, uint8_t dataLength, const uint8_t* ids, uint32_t* values, uint8_t count);

    /**
     * @brief Build and transmit a SYNC_WRITE packet from pre-encoded parameters.
     *
     * @param parameters       Pointer to pre-encoded parameter bytes.
     * @param parametersLength Number of parameter bytes.
     * @return True on success.
     */
    bool sendSyncWritePacket(const uint8_t* parameters, uint16_t parametersLength);

    /**
     * @brief Build and transmit a SYNC_READ packet.
     *
     * @param address    Control table register address to read.
     * @param dataLength Number of bytes to read from each servo.
     * @param ids        Array of servo IDs.
     * @param count      Number of servos.
     * @return True on success.
     */
    bool sendSyncReadPacket(uint16_t address, uint8_t dataLength, const uint8_t* ids, uint8_t count);

    /**
     * @brief Build and transmit a BULK_WRITE packet.
     *
     * @param parameters       Pre-encoded parameter bytes (ID + address + length + data per servo).
     * @param parametersLength Number of parameter bytes.
     * @return True on success.
     */
    bool sendBulkWritePacket(const uint8_t* parameters, uint16_t parametersLength);

    /**
     * @brief Build and transmit a BULK_READ packet.
     *
     * @param ids         Array of servo IDs.
     * @param addresses   Array of control table addresses, one per servo.
     * @param dataLengths Array of byte counts to read, one per servo.
     * @param count       Number of servos.
     * @return True on success.
     */
    bool sendBulkReadPacket(const uint8_t* ids, uint16_t* addresses, uint8_t* dataLengths, uint8_t count);

    /**
     * @brief Validate that the sync group contains at least `arraySize` entries.
     *
     * @param arraySize Minimum required number of motors in the sync group.
     * @return 0 if valid, non-zero error code otherwise.
     */
    uint8_t checkArraySize(uint8_t arraySize) const;
};

// Include template definitions.
#include "DynamixelLL.tpp"

#endif // DYNAMIXEL_LL_H
